main_app/app/controllers/plugins_controller.rb

  def index
    @plugins = Plugin.all
---
SELECT * FROM "plugins"

  def show
    @plugin = Plugin.find(params[:id])
---
SELECT * FROM "plugins" WHERE ("plugins"."id" = 1)

  def edit
    @plugin = Plugin.find(params[:id])
---
SELECT * FROM "plugins" WHERE ("plugins"."id" = 1)

  def update
    @plugin = Plugin.find(params[:id])

    respond_to do |format|
      if @plugin.update_attributes(params[:plugin])
---
SELECT * FROM "plugins" WHERE ("plugins"."id" = 1)
UPDATE "plugins" SET "updated_at" = '2010-08-12 19:40:53', "description" = 'Rest plugin' WHERE "id" = 1