main_app/app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.role_ids.empty?
      @user.role_ids = Array.[](Role.find_by_name("Subscriber").id)
    end

    if @user.save
---
SELECT "roles".id FROM "roles" INNER JOIN "roles_users" ON "roles".id = "roles_users".role_id WHERE ("roles_users".user_id = NULL )
SELECT "roles".* FROM "roles" INNER JOIN "roles_users" ON "roles".id = "roles_users".role_id WHERE ("roles"."name" = 'Admin') AND ("roles_users".user_id = NULL ) LIMIT 1
INSERT INTO "users" ("single_access_token", "last_request_at", "crypted_password", "perishable_token", "failed_login_count", "current_login_ip", "password_salt", "current_login_at", "persistence_token", "login_count", "last_login_ip", "last_login_at", "email") VALUES('j2wyQFraJJVaNIlq7FJ5', '2010-08-05 22:12:37', 'a7c940e1253e34d5718b7b546d1571262167feb8c456b7a3b2e25fcb8f2a6a79044a340123c8aaf3c265f01516269e72dac510caa24e2bcc0abbd500e2393a83', 'ucMCiXVASvUS5IHkbi', 0, '127.0.0.1', '7yDYSIX8mFd33MXDumob', '2010-08-05 22:12:37', 'e51c9fa556e024663d3ed4fd25f13e81dd8a16ef381bd550817738bbd287d5ba53f11404a77934e2dd4cab731e56ed37641386c8b6b0d66bb94b628d6ea27125', 1, NULL, NULL, 'luis.brandao@gmail.com')

  def update
    userid = User.find(params[:id]).id
    puts "USER ID #{userid}"
    @user = get_user_based_on_role
    if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = '2') LIMIT 1
UPDATE "users" SET "perishable_token" = 'l85Hdw4l3OaMHP4gLzo', "last_request_at" = '2010-08-05 23:57:20' WHERE "id" = 2

  def destroy
    @user = get_user_based_on_role
    authorize! :manage, @user

    if @user != @current_user
      @user.destroy
---
DELETE FROM "users" WHERE "id" = 13