data_api/app/controllers/configurations_controller.rb

SELECT * FROM "configurations" LIMIT 1
---
  def index
    @configurations = Configuration.all

SELECT * FROM "configurations" WHERE ("configurations"."id" = 1)
---
  def show
    @configuration = Configuration.find(params[:id])

SELECT * FROM "configurations" WHERE ("configurations"."id" = 1)
---
  def edit
    @configuration = Configuration.find(params[:id])

INSERT INTO "configurations" ("filter_field_name", "created_at", "updated_at", "query_where", "data_field_names", "user_name", "query_base", "data_field_friendly_name", "password") VALUES('Id', '2010-08-07 23:34:48', '2010-08-07 23:34:48', 'where id in', 'id, name, label, value', 'user', 'select id, name, label, value from websites', 'Id, Name, Label, Value', 'password')
---
  def create
    @configuration = Configuration.new(params[:configuration])

    respond_to do |format|
      if @configuration.save

SELECT * FROM "configurations" WHERE ("configurations"."id" = 2)
UPDATE "configurations" SET "updated_at" = '2010-08-13 19:37:49', "query_base" = 'delete select id, name, label, value from websites' WHERE "id" = 3
---
  def update
    @configuration = Configuration.find(params[:id])

    respond_to do |format|
      if @configuration.update_attributes(params[:configuration])

SELECT * FROM "configurations" WHERE ("configurations"."id" = 1)
DELETE FROM "configurations" WHERE "id" = 1
---
  def destroy
    @configuration = Configuration.find(params[:id])
    @configuration.destroy